# 출력
print("start")
a = 10
print(a)

#변수 선언
a,b = 10, 20

# if 다음줄은 들여쓰기
if a==10:
    print(a)


# 들여쓰기를 기준으로 모여있는 코드를 코드 블록이라고 한다.
if a==10:
    print('10')
    print('입니다')


# 나눗셈 결과는 실수로 출력한다.
>>>5/2
2.5

# 조건문
x=10
if x==10:
    print("x는 10입니다.")

# 입력받기
num = int(input())

if num==10:
    print("num은 10입니다.")
else: print("num은"+num+"입니다")






# 정수의 나눗셈 결과로 정수를 얻고 싶을 경우
>>>int(5/2)
2


#2진수 표현 : 숫자앞에 0b를 붙이며, 0-1사용
>>>0b110
6
#8진수 표현: 숫자앞에 0o를 붙이며 0-7사용
>>>0o10
8
#16진수 표현: 숫자앞에 0x 또는 0X를 붙이며 0-9, A-F 사용
>>>0xF
15


